Revit 2026 API

# ReferenceWithContext Methods

---

The ReferenceWithContext type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetInstanceTransform | Gets the transform of the instance. |
|  | GetReference | Gets the reference of the geometric object. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ReferenceWithContext Class

Autodesk.Revit.DB Namespace